pkg/wsman/wsmantesting/responses/amt/auditlog/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_AuditLog"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>5</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000002438</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_AuditLog</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_AuditLog>
            <g:AuditState>16</g:AuditState>
            <g:CurrentNumberOfRecords>161</g:CurrentNumberOfRecords>
            <g:ElementName>Intel(r) AMT Audit Log</g:ElementName>
            <g:EnabledState>2</g:EnabledState>
            <g:MaxAllowedAuditors>1</g:MaxAllowedAuditors>
            <g:MaxNumberOfRecords>0</g:MaxNumberOfRecords>
            <g:Name>Intel(r) AMT:Audit Log</g:Name>
            <g:OverwritePolicy>2</g:OverwritePolicy>
            <g:PercentageFree>92</g:PercentageFree>
            <g:RequestedState>2</g:RequestedState>
            <g:StoragePolicy>1</g:StoragePolicy>
            <g:TimeOfLastRecord>
                <h:Datetime>2024-01-03T00:44:35Z</h:Datetime>
            </g:TimeOfLastRecord>
        </g:AMT_AuditLog>
    </a:Body>
</a:Envelope>